############## создание стркуктуры гл и подгл ############
############## запись гл и подгл в переменные#############
---
model_engine11 = "text-davinci-003"
model_engine = "gpt-3.5-turbo"
with open('1.txt', 'w') as file:
    file.write('')
with open('2.txt', 'w') as file:
    file.write('')
text = "Заработная плата и нормирование труда, гарантии и компенсации"
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
time.sleep(60)
ll2 = ""
prompt = "составь мне план (структуру) для моего доклада на тему (" + text + ") план должен состоять из шести глав ,а главы должны состоять из двух под глав, в ответ ты должен записать только название глав и название подглав к ним без каких либо твоих пояснений и дополнений , не забудь пронумеровать главы вот так (1, 2, 3, 4, 5, 6) , а под главы пронумеруй так (1.1 1.2, 2.1 2.2 , 3.1 3.2, 4.1 4.2, 5.1 5.2 , 6.1 6.2)"
response = openai.Completion.create(
engine=model_engine11,
prompt=prompt,
max_tokens=2750,
n=1,
stop=None,
temperature=0.5,
)
ll2 = response.choices[0].text
print(ll2)
time.sleep(161)
with open("1.txt", "w", encoding='utf-8') as file:
   file.write(ll2)
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
# Открываем файл для чтения с указанием кодировки UTF-8
with open('1.txt', 'r', encoding='utf-8') as file:
  lines = file.readlines()
ww_vars = []
for line in lines:
  if re.search(r'\d', line) and len(line.strip()) > 0:
    ww_vars.append(line)
print(ww_vars[0])
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
---
---
---
############## вопросы с 2-й по 5-ю главу ################
##########################################################
ll4q1 = ""
prompt = "напиши очень кратко что нужно раскрыть, написать в данной части реферата (" + ww_vars[3] + ww_vars[4] + ww_vars[5] + ") этого реферата (" + text + ") чтобы часть реферата была содержательной напиши только 4 ключевых аспекта"
response = openai.ChatCompletion.create(
    model=model_engine,
    messages=[
        {"role": "system", "content": "You are a helpful assistant."},
        {"role": "user", "content": prompt}
    ]
)
if response['choices']:
    ll4q1 = response['choices'][0]['message']['content']
print(ll4q1)
time.sleep(165)
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
#================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА===========================================
#3================СОЗДАНИЕ ВЫСШЕГО ВОПРОСА==========================================
print("-------------------------------------------------------------------------------2222222222222")
ll4 = ""
#prompt2 ="расскажи по подробнее про (" + ll3q1 + ") ответ дай единым связанным текстом"
prompt2 ="расскажи по подробнее про (" + ll3q1 + ") , ответ должен быть расписан очень подробно и расказывать всю суть , по надобности приводить примеры того или иного, ответ дай в стиле реферата ,то есть ответ должен представлять чать реферата "
response = openai.ChatCompletion.create(
    model=model_engine,
    messages=[
        {"role": "system", "content": "You are a helpful assistant."},
        {"role": "user", "content": prompt2}
    ]
)
if response['choices']:
    ll4 = response['choices'][0]['message']['content']
print(ll4)
time.sleep(166)
print("-------------------------------------------------------------------------------222222222222")
###########################################################